experiments/results/logs/ramp-hpa-002/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7224.279ms, rate sampling interval: 18284ms
  Thread calibration: mean lat.: 7798.694ms, rate sampling interval: 17104ms
  Thread calibration: mean lat.: 7289.487ms, rate sampling interval: 17072ms
  Thread calibration: mean lat.: 7637.893ms, rate sampling interval: 18317ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.24m     1.19m    4.32m    57.33%
    Req/Sec     3.05      0.28     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.23m 
 75.000%    3.27m 
 90.000%    3.88m 
 99.000%    4.24m 
 99.900%    4.29m 
 99.990%    4.33m 
 99.999%    4.33m 
100.000%    4.33m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9355.263     0.000000            2         1.00
   35880.959     0.100000          420         1.11
   59932.671     0.200000          840         1.25
   84803.583     0.300000         1262         1.43
  110100.479     0.400000         1681         1.67
  133693.439     0.500000         2101         2.00
  145358.847     0.550000         2309         2.22
  158990.335     0.600000         2520         2.50
  171704.319     0.650000         2729         2.86
  184549.375     0.700000         2939         3.33
  196476.927     0.750000         3149         4.00
  202244.095     0.775000         3254         4.44
  209321.983     0.800000         3361         5.00
  214564.863     0.825000         3466         5.71
  220987.391     0.850000         3568         6.67
  227147.775     0.875000         3673         8.00
  230555.647     0.887500         3725         8.89
  232914.943     0.900000         3779        10.00
  235274.239     0.912500         3831        11.43
  239206.399     0.925000         3884        13.33
  242614.271     0.937500         3935        16.00
  244449.279     0.943750         3962        17.78
  245759.999     0.950000         3990        20.00
  246939.647     0.956250         4017        22.86
  247857.151     0.962500         4046        26.67
  249561.087     0.968750         4072        32.00
  250609.663     0.971875         4079        35.56
  251658.239     0.975000         4097        40.00
  252444.671     0.978125         4106        45.71
  252837.887     0.981250         4120        53.33
  253624.319     0.984375         4137        64.00
  253755.391     0.985938         4140        71.11
  254148.607     0.987500         4145        80.00
  254672.895     0.989062         4155        91.43
  254803.967     0.990625         4159       106.67
  255197.183     0.992188         4165       128.00
  255459.327     0.992969         4170       142.22
  255590.399     0.993750         4174       160.00
  255721.471     0.994531         4175       182.86
  255983.615     0.995313         4179       213.33
  256376.831     0.996094         4183       256.00
  256376.831     0.996484         4183       284.44
  256507.903     0.996875         4185       320.00
  256638.975     0.997266         4190       365.71
  256638.975     0.997656         4190       426.67
  256638.975     0.998047         4190       512.00
  256638.975     0.998242         4190       568.89
  256770.047     0.998437         4191       640.00
  256901.119     0.998633         4192       731.43
  257294.335     0.998828         4193       853.33
  257294.335     0.999023         4193      1024.00
  257687.551     0.999121         4194      1137.78
  257687.551     0.999219         4194      1280.00
  258080.767     0.999316         4195      1462.86
  258080.767     0.999414         4195      1706.67
  258080.767     0.999512         4195      2048.00
  259391.487     0.999561         4196      2275.56
  259391.487     0.999609         4196      2560.00
  259391.487     0.999658         4196      2925.71
  259391.487     0.999707         4196      3413.33
  259391.487     0.999756         4196      4096.00
  259522.559     0.999780         4197      4551.11
  259522.559     1.000000         4197          inf
#[Mean    =   134145.459, StdDeviation   =    71559.637]
#[Max     =   259391.488, Total count    =         4197]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4295 requests in 5.00m, 44.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 10684
Requests/sec:     14.31
Transfer/sec:    150.41KB